onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Д_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) Экспорт
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	// Начало доработки:
	// {{ Краснокутский С.Н.: Добавление ГруппыСкидка и Команды "Пересчитать табличную часть"
    Группа = Элементы.Вставить("ГруппаСкидка",Тип ("ГруппаФормы"),Элементы.ГруппаШапкаЛево);
    Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Скидка";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Команда = Команды.Добавить("Д_ПересчитатьТабличнуюЧасть");	
	Команда.Заголовок = "Пересчитать табличную часть(Д)";
	Команда.Действие = "Д_ПересчитатьТабличнуюЧасть";
	КнопкаКоманды = Элементы.Добавить("Д_ПересчитатьТабличнуюЧасть", Тип("КнопкаФормы"), Элементы.ГруппаСкидка);
	КнопкаКоманды.ИмяКоманды = "Д_ПересчитатьТабличнуюЧасть";
	КнопкаКоманды.Заголовок = "Пересчитать табличную часть";
	КнопкаКоманды.Картинка = БиблиотекаКартинок.Обновить;
	КнопкаКоманды.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	ВывестиРеквизитНаФорму()
	// Конец доработки }}
КонецПроцедуры 

&НаСервере
Процедура ВывестиРеквизитНаФорму()
	// Начало доработки:
	// {{ Краснокутский С.Н.: Процедура вывода реквизита на форму"
	Если Элементы.Найти("Д_КонтактноеЛицо") = Неопределено Тогда	
		НовыйЭлемент = Элементы.Добавить("Д_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);   
		НовыйЭлемент.ПутьКДанным = "Объект.Д_КонтактноеЛицо";  
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлемент.Заголовок = "Контактное лицо";	
	КонецЕсли; 
	
	Если Элементы.Найти("Д_СогласованнаяСкидка") = Неопределено Тогда	
		ЭлементСкидка = Элементы.Вставить("Д_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаСкидка, Элементы.Д_ПересчитатьТабличнуюЧасть);   
		ЭлементСкидка.ПутьКДанным = "Объект.Д_СогласованнаяСкидка";  
		ЭлементСкидка.Вид = ВидПоляФормы.ПолеВвода; 
		ЭлементСкидка.Заголовок = "Согласованная скидка";
		ЭлементСкидка.УстановитьДействие("ПриИзменении", "Д_СогласованнаяСкидкаПриИзменении");
	КонецЕсли; 
	// Конец доработки }}
КонецПроцедуры 

&НаКлиенте
Процедура Д_ПересчитатьТабличнуюЧасть(Команда)
	// Начало доработки:
	// {{ Краснокутский С.Н.: Команда "Пересчитать табличную часть"
	ПересчитатьТабличнуюЧасть()	
    // Конец доработки }}
КонецПроцедуры

&НаКлиенте
Процедура Д_СогласованнаяСкидкаПриИзменении(Элемент)
	// Начало доработки:
	// {{ Краснокутский С.Н.: Процедура с предложением пересчитать скидку
	АсинхД_СогласованнаяСкидкаПриИзменении();
	// Конец доработки }}
КонецПроцедуры

&НаКлиенте
Асинх Процедура АсинхД_СогласованнаяСкидкаПриИзменении()
	// Начало доработки:
	// {{ Краснокутский С.Н.: Процедура с предложением пересчитать скидку	
	Если Объект.Товары.Количество() > 0 Или Объект.Услуги.Количество() > 0 Тогда
		Результат = Ждать ВопросАсинх("Пересчитать табличную часть с учётом новой скидки?", РежимДиалогаВопрос.ДаНет);
		Если Результат = КодВозвратаДиалога.Да Тогда
			ПересчитатьТабличнуюЧасть();
		КонецЕсли;	
	КонецЕсли;
   // Конец доработки }}
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТабличнуюЧасть()
	// Начало доработки:
	// {{ Краснокутский С.Н.: Процедура пересчета строк табличной части
	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл 
		РассчитатьСуммуСтроки(СтрокаТаблицы);	
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(СтрокаТаблицы);
	КонецЦикла;
	// Конец доработки }}
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Начало доработки:
	// {{ Краснокутский С.Н.: Добавлена процедура вывода реквизитов на форму
	ВывестиРеквизитНаФорму();
    // Конец доработки }}
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	// Начало доработки:
	// {{ Краснокутский С.Н.: Процедура пересчета строки в табличной части документа
	// Исходный код ,начало:
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	// Конец исходного кода
	КоэффициентСкидки = 1 - ((ТекущиеДанные.Скидка / 100) + (Объект.Д_СогласованнаяСкидка / 100)) ;
	Если КоэффициентСкидки < 0 Тогда
	КоэффициентСкидки = 0;
	ТексСообщения = "Скидка больше 100% быть не может !!!" + " Строка № " + (ТекущиеДанные.НомерСтроки) + " " + (ТекущиеДанные.Номенклатура);	
	Сообщить(ТексСообщения);
	КонецЕсли;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	РассчитатьСуммуДокумента();
	// Конец доработки }}	

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
